a = float(input('დაწერეთ პირველი რიცხვი '))
b = float(input('დაწერეთ მეორე რიცხვი '))
print('a + b =', a+b, '\na - b =', a - b, '\na * b =', a*b, '\na / b =', a / b, '\na ^ b=', a ** b)


a = float(input('რა სიგრძისაა პირველი დიაგონალი '))
b = float(input('რა სიგრძისაა მეორე დიაგონალი '))
print('რომბის ფართობი არის ', (a*b)/2)


a = float(input('რამდენი მეტრი დავაკონვერტიროთ '))
print('სანტიმეტრებში ', a * 100, '\nდეციმეტრებში ', a*10, '\nმილიმეტრებში ', a*1000, '\nმილში ', a/1609.344)

a = float(input('რა სიგრძისაა სამმკუთხედის გვერდი '))
b = float(input('რა სიგრძისაა სიმაღლე '))
print('სამკუთხედის ფართობი არის ', (a*b)/2)